Revit 2024 API
TextElement.Height Property
 Height of the area of the text content.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Height { get; }
Visual Basic
Public ReadOnly Property Height As Double
	Get
Visual C++
public:
property double Height {
	double get ();
}
Remarks
The value is in sheet units, meaning it is as when measured on a printed sheet. The measurement is of the text content only; the border around it (if specified) is excluded.
This is a read-only property, for the height of the text area is calculated depending on the text content and its wrapping.
See Also
TextElement Class
Autodesk.Revit.DB Namespace